<template>
  <div id="">
    <div
      class="echart-map"
      ref="myEchart"
      @mousedown="mousedown"
      @mouseup="mouseup"
    ></div>
  </div>
</template>

<script>
import axios from "axios";
import echarts from "echarts";
import "echarts/map/js/china.js";
import "echarts/map/js/world.js";
import {
  mapProvinceName,
  mapCityName,
  provinceNameTrans,
  mapCountryName,
} from "../constant/lib.js"; // 引入省市对应英文名字

export default {
  name: "Map",
  data() {
    return {
      diamond: require('../assets/diamond.png'),
      echart: null,
      // echart地图的配置项
      option: {},

      // 地图拖动起止位置（用于拖动不触发返回事件）
      mouse_position: {
        beginX: "",
        beginY: "",
        endX: "",
        endY: "",
      },
      placeType: "world",
      // 当前省
      province: {
        name: "",
        code: "",
      },
      // 当前市
      city: {
        name: "",
        code: "",
      },
      // 城市数据显示
      data: [
        { name: "丽江市", value: 9 },
        { name: "昭通市", value: 9 },
        { name: "普洱市", value: 9 },
        { name: "临沧市", value: 9 },
        { name: "西双版纳傣族自治州", value: 9 },
        { name: "玉溪市", value: 9 },
        { name: "文山壮族苗族自治州", value: 9 },
        { name: "红河哈尼族彝族自治州", value: 9 },
        { name: "迪庆藏族自治州", value: 9 },
        { name: "怒江傈族自治州", value: 9 },
        { name: "大理白族自治州", value: 9 },
        { name: "保山市", value: 9 },
        { name: "德宏傣族景颇族自治州", value: 9 },
        { name: "楚雄彝族自治州", value: 9 },

        { name: "儋州市", value: 9 },
        { name: "文昌市", value: 9 },

        { name: "黑河市", value: 9 },
        { name: "大兴安岭地区", value: 9 },
        { name: "伊春市", value: 9 },
        { name: "鹤岗市", value: 9 },
        { name: "佳木斯市", value: 9 },
        { name: "双鸭山市", value: 9 },
        { name: "七台河市", value: 9 },
        { name: "鸡西市", value: 9 },
        { name: "绥化市", value: 9 },

        { name: "白城市", value: 9 },
        { name: "松原市", value: 9 },
        { name: "四平市", value: 9 },
        { name: "吉林市", value: 9 },
        { name: "辽源市", value: 9 },
        { name: "通化市", value: 9 },
        { name: "白山市", value: 9 },
        { name: "延边朝鲜族自治州", value: 9 },

        { name: "铁岭市", value: 9 },
        { name: "辽阳市", value: 9 },
        { name: "阜新市", value: 9 },
        { name: "朝阳市", value: 9 },

        { name: "朔州市", value: 9 },
        { name: "忻州市", value: 9 },
        { name: "吕梁市", value: 9 },
        { name: "晋中市", value: 9 },
        { name: "晋城市", value: 9 },
        { name: "运城市", value: 9 },

        { name: "濮阳", value: 9 },
        { name: "鹤壁", value: 9 },
        { name: "新乡", value: 9 },
        { name: "商丘", value: 9 },
        { name: "周口", value: 9 },
        { name: "漯河", value: 9 },
        { name: "许昌", value: 9 },
        { name: "南阳市", value: 9 },
        { name: "驻马店", value: 9 },
        { name: "信阳", value: 9 },

        { name: "榆林", value: 9 },
        { name: "汉中", value: 9 },
        { name: "安康", value: 9 },
        { name: "商洛", value: 9 },

        { name: "淮北市", value: 9 },
        { name: "宿州", value: 9 },
        { name: "亳州", value: 9 },
        { name: "蚌埠", value: 9 },
        { name: "滁州", value: 9 },
        { name: "淮南", value: 9 },
        { name: "阜阳", value: 9 },
        { name: "六安", value: 9 },
        { name: "巢湖市", value: 9 },
        { name: "铜陵", value: 9 },
        { name: "安庆", value: 9 },
        { name: "池州", value: 9 },
        { name: "黄山", value: 9 },
        { name: "宣城", value: 9 },

        { name: "南平", value: 9 },
        { name: "三明市", value: 9 },
        { name: "宁德", value: 9 },
        { name: "莆田", value: 9 },
        { name: "漳州", value: 9 },
        { name: "龙岩", value: 9 },

        { name: "吴忠", value: 9 },
        { name: "中卫", value: 9 },
        { name: "固原", value: 9 },

        { name: "景德镇", value: 9 },
        { name: "上饶", value: 9 },
        { name: "南昌", value: 9 },
        { name: "鹰潭", value: 9 },
        { name: "抚州", value: 9 },
        { name: "宜春", value: 9 },
        { name: "新余", value: 9 },
        { name: "萍乡", value: 9 },
        { name: "吉安", value: 9 },
        { name: "赣州", value: 9 },

        { name: "十堰", value: 9 },
        { name: "襄樊", value: 9 },
        { name: "随州", value: 9 },
        { name: "孝感", value: 9 },
        { name: "黄冈市", value: 9 },
        { name: "恩施土家族苗族自治州", value: 9 },
        { name: "荆门", value: 9 },
        { name: "潜江", value: 9 },
        { name: "仙桃", value: 9 },
        { name: "咸宁", value: 9 },
        { name: "黄石", value: 9 },
        { name: "鄂州", value: 9 },

        { name: "湘西土家族苗族自治州", value: 9 },
        { name: "娄底市", value: 9 },
        { name: "衡阳", value: 9 },
        { name: "邵阳", value: 9 },
        { name: "怀化", value: 9 },
        { name: "永州", value: 9 },
        { name: "郴州", value: 9 },

        { name: "铜仁地区", value: 9 },
        { name: "毕节地区", value: 9 },
        { name: "安顺", value: 9 },
        { name: "六盘水", value: 9 },
        { name: "黔西南布衣族苗族自治州", value: 9 },
        { name: "黔南布衣族苗族自治州", value: 9 },
        { name: "黔东南苗族侗族自治州", value: 9 },

        { name: "百色市", value: 9 },
        { name: "河池", value: 9 },
        { name: "贺州市", value: 9 },
        { name: "梧州市", value: 9 },
        { name: "玉林", value: 9 },
        { name: "钦州", value: 9 },
        { name: "防城港市", value: 9 },
        { name: "贵港市", value: 9 },
        { name: "崇左市", value: 9 },

        { name: "呼伦贝尔市", value: 9 },
        { name: "兴安盟", value: 9 },
        { name: "通辽市", value: 9 },
        { name: "锡林郭勒盟", value: 9 },
        { name: "乌兰察布市", value: 9 },
        { name: "巴彦淖尔市", value: 9 },
        { name: "乌海市", value: 9 },
        { name: "阿拉善盟", value: 9 },

        { name: "酒泉市", value: 9 },
        { name: "张掖市", value: 9 },
        { name: "武威市", value: 9 },
        { name: "白银市", value: 9 },
        { name: "庆阳市", value: 9 },
        { name: "平凉市", value: 9 },
        { name: "天水市", value: 9 },
        { name: "陇南市", value: 9 },
        { name: "定西市", value: 9 },
        { name: "甘南藏族自治州", value: 9 },
        { name: "临夏回族自治州", value: 9 },

        { name: "海西蒙古族藏族自治州", value: 9 },
        { name: "海北藏族自治州", value: 9 },
        { name: "西宁市", value: 9 },
        { name: "海东地区", value: 9 },
        { name: "玉树藏族自治州", value: 9 },
        { name: "果洛藏族自治州", value: 9 },
        { name: "海南藏族自治州", value: 9 },
        { name: "黄南藏族自治州", value: 9 },

        { name: "甘孜藏族自治州", value: 9 },
        { name: "阿坝藏族羌族自治州", value: 9 },
        { name: "广元", value: 9 },
        { name: "巴中", value: 9 },
        { name: "达州", value: 9 },
        { name: "广安", value: 9 },
        { name: "遂宁", value: 9 },
        { name: "资阳", value: 9 },
        { name: "内江", value: 9 },
        { name: "乐山", value: 9 },
        { name: "雅安", value: 9 },
        { name: "凉山彝族自治州", value: 9 },

        { name: "那曲地区", value: 9 },
        { name: "阿里地区", value: 9 },
        { name: "日喀则地区", value: 9 },
        { name: "山南地区", value: 9 },
        { name: "林芝地区", value: 9 },
        { name: "昌都地区", value: 9 },

        { name: "琼海", value: 9 },
        { name: "万宁市", value: 9 },
        { name: "五指山", value: 9 },
        { name: "东方", value: 9 },
        { name: "定安县", value: 9 },
        { name: "屯昌县", value: 9 },
        { name: "临高县", value: 9 },
        { name: "白沙黎族自治县", value: 9 },
        { name: "昌江黎族自治县", value: 9 },
        { name: "陵水黎族自治县", value: 9 },
        { name: "乐东黎族自治县", value: 9 },
        { name: "保亭黎族苗族自治县", value: 9 },

        { name: "海门", value: 9 },
        { name: "鄂尔多斯", value: 12 },
        { name: "招远", value: 12 },
        { name: "舟山市", value: 12 },
        { name: "齐齐哈尔", value: 14 },
        { name: "盐城", value: 15 },
        { name: "赤峰", value: 16 },
        { name: "青岛", value: 18 },
        { name: "乳山", value: 18 },
        { name: "金昌", value: 19 },
        { name: "泉州", value: 21 },
        { name: "莱西", value: 21 },
        { name: "日照", value: 21 },
        { name: "胶南", value: 22 },
        { name: "南通", value: 23 },
        { name: "天门市", value: 23 },


        { name: "云浮", value: 24 },
        { name: "梅州", value: 25 },
        { name: "文登", value: 25 },
        { name: "上海", value: 25 },
        { name: "攀枝花", value: 25 },
        { name: "威海", value: 25 },
        { name: "承德", value: 25 },

        { name: "汕尾", value: 26 },
        { name: "潮州", value: 26 },
        { name: "丹东市", value: 27 },
        { name: "太仓", value: 27 },
        { name: "曲靖", value: 27 },
        { name: "烟台", value: 28 },
        { name: "福州", value: 29 },
        { name: "瓦房店", value: 30 },
        { name: "即墨", value: 30 },
        { name: "抚顺市", value: 31 },
        { name: "张家口市", value: 31 },
        { name: "阳泉", value: 31 },
        { name: "莱州", value: 32 },
        { name: "湖州市", value: 32 },
        { name: "汕头", value: 32 },
        { name: "昆山", value: 33 },
        { name: "宁波", value: 33 },
        { name: "湛江", value: 33 },
        { name: "揭阳", value: 34 },
        { name: "荣成", value: 34 },
        { name: "连云港", value: 35 },
        { name: "葫芦岛", value: 35 },
        { name: "常熟", value: 36 },
        { name: "东莞", value: 36 },
        { name: "河源", value: 36 },
        { name: "淮安", value: 36 },
        { name: "泰州", value: 36 },
        { name: "南宁", value: 37 },
        { name: "营口", value: 37 },
        { name: "惠州", value: 37 },
        { name: "江阴", value: 37 },
        { name: "蓬莱", value: 37 },
        { name: "韶关", value: 38 },
        { name: "嘉峪关", value: 38 },

        { name: "延安", value: 38 },

        { name: "清远", value: 39 },
        { name: "中山", value: 39 },

        { name: "寿光", value: 40 },
        { name: "盘锦", value: 40 },
        { name: "长治", value: 41 },
        { name: "深圳", value: 41 },
        { name: "珠海", value: 42 },
        { name: "宿迁", value: 43 },
        { name: "咸阳市", value: 43 },
        { name: "铜川", value: 44 },
        { name: "平度", value: 44 },
        { name: "佛山", value: 44 },

        { name: "江门", value: 45 },
        { name: "章丘", value: 45 },
        { name: "肇庆", value: 46 },
        { name: "大连", value: 47 },
        { name: "临汾", value: 47 },
        { name: "吴江", value: 47 },
        { name: "石嘴山", value: 49 },

        { name: "苏州", value: 50 },
        { name: "茂名", value: 50 },
        { name: "嘉兴", value: 51 },

        { name: "胶州", value: 52 },
        { name: "银川", value: 52 },
        { name: "张家港", value: 52 },
        { name: "三门峡市", value: 53 },
        { name: "锦州", value: 54 },

        { name: "柳州", value: 54 },
        { name: "三亚", value: 54 },
        { name: "自贡", value: 56 },
        { name: "阳江", value: 57 },
        { name: "泸州", value: 57 },
        { name: "宜宾", value: 58 },
        { name: "大同", value: 58 },
        { name: "镇江", value: 59 },
        { name: "桂林市", value: 59 },
        { name: "张家界", value: 59 },
        { name: "宜兴", value: 59 },
        { name: "北海", value: 60 },
        { name: "西安", value: 61 },
        { name: "金坛", value: 62 },
        { name: "东营", value: 62 },
        { name: "牡丹江", value: 63 },
        { name: "遵义", value: 63 },
        { name: "绍兴", value: 63 },
        { name: "扬州", value: 64 },
        { name: "常州", value: 64 },
        { name: "潍坊", value: 65 },
        { name: "台州市", value: 67 },
        { name: "滨州", value: 70 },
        { name: "贵阳", value: 71 },
        { name: "无锡", value: 71 },
        { name: "本溪", value: 71 },
        { name: "克拉玛依", value: 72 },
        { name: "渭南市", value: 72 },
        { name: "马鞍山", value: 72 },
        { name: "宝鸡", value: 72 },
        { name: "焦作市", value: 75 },
        { name: "句容", value: 75 },
        { name: "徐州", value: 79 },
        { name: "衡水", value: 80 },
        { name: "包头", value: 80 },
        { name: "绵阳", value: 80 },
        { name: "枣庄", value: 84 },
        { name: "淄博", value: 85 },
        { name: "鞍山", value: 86 },
        { name: "溧阳", value: 86 },
        { name: "库尔勒", value: 86 },
        { name: "安阳市", value: 90 },
        { name: "开封", value: 90 },
        { name: "德阳", value: 93 },
        { name: "温州", value: 95 },
        { name: "九江", value: 96 },
        { name: "邯郸", value: 98 },
        { name: "临安", value: 99 },
        { name: "来宾市", value: 22 },

        { name: "沧州", value: 100 },
        { name: "临沂", value: 103 },
        { name: "南充", value: 104 },

        { name: "富阳", value: 106 },
        { name: "泰安", value: 112 },
        { name: "诸暨", value: 112 },

        { name: "聊城", value: 116 },
        { name: "芜湖", value: 117 },
        { name: "唐山", value: 119 },
        { name: "平顶山", value: 119 },
        { name: "邢台", value: 119 },
        { name: "德州", value: 120 },
        { name: "济宁", value: 120 },
        { name: "荆州", value: 127 },
        { name: "宜昌", value: 130 },
        { name: "义乌", value: 132 },
        { name: "丽水", value: 133 },
        { name: "洛阳", value: 134 },
        { name: "秦皇岛", value: 136 },
        { name: "株洲市", value: 143 },

        { name: "莱芜", value: 148 },
        { name: "常德", value: 152 },
        { name: "保定", value: 153 },
        { name: "湘潭", value: 154 },
        { name: "金华", value: 157 },
        { name: "岳阳", value: 169 },

        { name: "衢州市", value: 177 },
        { name: "廊坊市", value: 193 },
        { name: "菏泽", value: 194 },

        { name: "大庆市", value: 279 },
        { name: "哈尔滨市", value: 114 },
        { name: "石家庄", value: 147 },
        { name: "杭州", value: 84 },
        { name: "郑州", value: 113 },
        { name: "南京", value: 67 },
        { name: "武汉", value: 273 },
        { name: "天津", value: 105 },
        { name: "北京", value: 79 },
        { name: "呼和浩特", value: 58 },
        { name: "乌鲁木齐", value: 84 },
        { name: "广州", value: 38 },
        { name: "海口市", value: 44 },
        { name: "长春", value: 51 },
        { name: "沈阳", value: 50 },
        { name: "兰州", value: 99 },
        { name: "昆明", value: 39 },
        { name: "太原", value: 39 },
        { name: "拉萨", value: 24 },
        { name: "重庆", value: 66 },
        { name: "厦门", value: 26 },
        { name: "成都", value: 58 },
        { name: "合肥", value: 229 },
        { name: "长沙市", value: 175 },
        { name: "济南", value: 92 },
      ],
      provinceData: [
        { name: "天津", value: 6 },
        { name: "上海", value: 6 },
        { name: "重庆", value: 6 },
        { name: "河北", value: 6 },
        { name: "河南", value: 6 },
        { name: "云南", value: 6 },
        { name: "辽宁", value: 6 },
        { name: "黑龙江", value: 6 },
        { name: "湖南", value: 6 },
        { name: "安徽", value: 6 },
        { name: "山东", value: 6 },
        { name: "新疆", value: 6 },
        { name: "江苏", value: 6 },
        { name: "浙江", value: 6 },
        { name: "江西", value: 6 },
        { name: "湖北", value: 6 },
        { name: "广西", value: 6 },
        { name: "甘肃", value: 6 },
        { name: "山西", value: 6 },
        { name: "内蒙古", value: 6 },
        { name: "陕西", value: 6 },
        { name: "吉林", value: 6 },
        { name: "福建", value: 6 },
        { name: "贵州", value: 6 },
        { name: "广东", value: 6 },
        { name: "青海", value: 6 },
        { name: "西藏", value: 6 },
        { name: "四川", value: 6 },
        { name: "宁夏", value: 6 },
        { name: "海南", value: 6 },
        { name: "台湾", value: 6 },
        { name: "香港", value: 6 },
        { name: "澳门", value: 6 },
      ],
      provinceCenter: [
        { name: "黑龙江", value: 114 },
        { name: "河北", value: 147 },
        { name: "浙江", value: 84 },
        { name: "河南", value: 113 },
        { name: "江苏", value: 67 },
        { name: "湖北", value: 273 },
        { name: "天津", value: 105 },
        { name: "北京", value: 79 },
        { name: "内蒙古", value: 58 },
        { name: "新疆", value: 84 },
        { name: "青海", value: 88},
        { name: "广东", value: 38 },
        { name: "海南", value: 44 },
        { name: "吉林", value: 51 },
        { name: "辽宁", value: 50 },
        { name: "甘肃", value: 99 },
        { name: "云南", value: 39 },
        { name: "山西", value: 39 },
        { name: "西藏", value: 24 },
        { name: "重庆", value: 66 },
        { name: "福建", value: 26 },
        { name: "四川", value: 58 },
        { name: "安徽", value: 229 },
        { name: "湖南", value: 175 },
        { name: "山东", value: 92 },
        { name: "贵州", value: 92 },
        { name: "广西", value: 92 },
        { name: "江西", value: 92 },
        { name: "陕西", value: 92 },
        { name: "宁夏", value: 92 },
        { name: "上海", value: 92 },
      ],
      countryData: [
        { name: "纽约", value: 222 },
        { name: "里约热内卢", value: 231 },
        { name: "莫斯科", value: 122 },
        { name: "渥太华", value: 98 },
      ],
      // 散点地理位置
      /*
        经度：东经为正数，西经为负数。
        纬度：北纬为正数，南纬为负数。
        右增 下减
        */
      geoCoordMap: {
        //省地理坐标
        新疆: [88.61, 40.82],
        青海: [99.85,35.62],
        西藏: [92.11, 30.97],
        内蒙古: [109.20, 40.82],
        黑龙江: [127.00, 48.20],
        吉林: [127.33, 42.66],
        辽宁: [123.38, 40.8],
        甘肃: [104.73, 34.80],
        四川: [101.50, 30.67],
        云南: [101.73, 23.40],
        山西: [112.20, 38.20],
        湖南: [112.00, 26.85],
        广东: [113.11, 23.16],
        贵州: [107.40, 27.70],
        广西: [108.99, 24.30],
        山东: [118.00, 35.25],
        安徽: [117.27, 32.86],
        河南: [113.65, 34.76],
        江西: [115.89, 28.88],
        福建: [117.70, 24.88],
        浙江: [120.19, 28.26],
        湖北: [111.60, 31.52],
        海南: [110.35, 20.02],
        江苏: [119.78, 31.88],
        陕西: [108.55, 33.27],
        宁夏: [106.27, 38.47],
        河北: [114.80, 37.20],
        重庆: [108.80, 31.00],
        //市地理坐标
        阿克苏地区: [80.260604, 41.168779],
        和田地区: [79.922211, 37.114157],
        上海: [121.480237, 31.236305],
        东莞: [113.758231, 23.026997],
        东营: [118.588614, 37.454925],
        中山: [113.399023, 22.522262],
        临汾: [111.526153, 36.094052],
        临沂: [118.36299, 35.110531],
        丹东市: [124.00, 40.30],
        丽水: [119.929503, 28.472979],
        乌鲁木齐: [87.623314, 43.832806],
        佛山: [113.128432, 23.027707],
        保定: [115.471052, 38.880055],
        兰州: [103.840692, 36.067312],
        包头: [109.846755, 40.663636],
        北京: [116.413554, 39.911013],
        北海: [109.126614, 21.486955],
        南京: [118.802891, 32.064735],
        南宁: [108.373351, 22.823037],
        南昌: [115.864528, 28.687675],
        南通: [120.900301, 31.985237],
        厦门: [118.095915, 24.485821],
        台州市: [121.426996, 28.662297],
        合肥: [117.235447, 31.82687],
        呼和浩特: [111.758518, 40.847461],
        咸阳市: [108.715712, 34.55],
        哈尔滨市: [127.542417, 45.807782],
        唐山: [118.187036, 39.636673],
        嘉兴: [120.762045, 30.750912],
        大同: [113.306446, 40.082539],
        大连: [121.621391, 38.919345],
        天津: [117.205914, 39.090908],
        太原: [112.55706, 37.876885],
        威海: [122.128245, 37.519322],
        宁波: [121.556686, 29.880177],
        宝鸡: [107.243899, 34.367747],
        宿迁: [118.282062, 33.967686],
        常州: [119.980142, 31.816791],
        广州: [113.270793, 23.135308],
        廊坊市: [116.69034, 39.20],
        延安: [109.496361, 36.591003],
        张家口市: [114.894165, 40.00],
        徐州: [117.29235, 34.210143],
        德州: [116.365825, 37.441313],
        惠州: [114.423348, 23.116409],
        成都: [104.071216, 30.576279],
        扬州: [119.419107, 32.39986],
        承德: [117.969798, 40.957855],
        拉萨: [91.121025, 29.650088],
        无锡: [120.318954, 31.496704],
        日照: [119.533606, 35.422798],
        昆明: [102.839667, 24.885953],
        杭州: [120.161693, 30.280059],
        枣庄: [117.328513, 34.816569],
        柳州: [109.42198, 24.331519],
        株洲市: [113.33, 27.66],
        武汉: [114.311831, 30.598428],
        汕头: [116.688739, 23.359289],
        江门: [113.088165, 22.584459],
        沈阳: [123.438973, 41.811339],
        沧州: [116.845272, 38.31022],
        河源: [114.707097, 23.749829],
        泉州: [118.682316, 24.880242],
        泰安: [117.094893, 36.205905],
        泰州: [119.932115, 32.4612],
        济南: [117.001319, 36.671627],
        济宁: [116.593852, 35.420269],
        海口市: [110.40, 19.90],
        淄博: [118.061254, 36.819182],
        淮安: [119.022429, 33.616272],
        深圳: [114.066112, 22.548515],
        清远: [113.062619, 23.688238],
        温州: [120.705869, 28.001095],
        渭南市: [109.66, 34.505687],
        湖州市: [120.094566, 30.899015],
        湘潭: [112.950575, 27.83585],
        滨州: [117.9792, 37.388387],
        潍坊: [119.168138, 36.713212],
        烟台: [121.454425, 37.469868],
        玉溪市: [102.5537, 24.357512],
        珠海: [113.583235, 22.276392],
        盐城: [120.168187, 33.355301],
        盘锦: [122.077269, 41.125939],
        石家庄: [114.520828, 38.048684],
        福州: [119.302938, 26.080447],
        秦皇岛: [119.606184, 39.941259],
        绍兴: [120.586673, 30.036519],
        聊城: [115.992077, 36.462681],
        肇庆: [112.47177, 23.052984],
        舟山市: [122.214339, 29.991092],
        苏州: [120.589613, 31.304566],
        莱芜: [117.683221, 36.219357],
        菏泽: [115.487696, 35.239435],
        营口: [122.241475, 40.672565],
        葫芦岛: [120.843388, 40.717364],
        衡水: [115.676942, 37.745166],
        衢州市: [118.880768, 28.941661],
        西宁市: [101.784269, 36.623477],
        西安: [108.946306, 34.347436],
        贵阳: [106.636816, 26.652747],
        连云港: [119.229571, 34.602342],
        邢台: [114.510889, 37.076646],
        邯郸: [114.545808, 36.631222],
        郑州: [113.631349, 34.753488],
        鄂尔多斯: [109.787314, 39.61463],
        金华: [119.654027, 29.084455],
        铜川: [108.951558, 34.902957],
        银川: [106.238976, 38.492392],
        镇江: [119.431494, 32.195688],
        长春: [125.33017, 43.82178],
        长沙市: [113.66, 28.233971],
        长治: [113.123046, 36.201585],
        阳泉: [113.587087, 37.86234],
        青岛: [120.389445, 36.072358],
        韶关: [113.603757, 24.816174],
        九江: [116.007993, 29.711328],
        大庆市: [124.80, 46.90],
        宁德: [119.554701, 26.671748],
        忻州市: [112.740804, 38.422382],
        石嘴山: [106.39078, 38.989783],
        池州: [117.497839, 30.67098],
        淮南: [117.006189, 32.631837],
        吐鲁番地区: [89.196029, 42.957303],
        宜昌: [111.292971, 30.697602],
        景德镇: [117.184967, 29.274337],
        安庆: [117.070127, 30.548594],
        怒江傈僳族自治州: [98.863189, 25.823736],
        白城市: [122.845302, 45.6254],
        萍乡: [113.86077, 27.62897],
        抚州: [116.364627, 27.953603],
        朝阳市: [120.457301, 41.579487],
        海东: [102.003965, 36.406412],
        湘西土家族苗族自治州: [109.745507, 28.317399],
        鹰潭: [117.075765, 28.265879],
        阿拉善盟: [105.735357, 38.857806],
        大阪府: [0, 0],
        鹤岗市: [130.304284, 47.356043],
        吴忠: [106.205161, 38.003863],
        石河子: [86.085507, 44.312423],
        开封: [114.313904, 34.802941],
        延边朝鲜族自治州: [129.515602, 42.897211],
        白银市: [104.144182, 36.550821],
        吕梁市: [111.148086, 37.525476],
        随州: [113.389071, 31.696341],
        雅安: [103.04636, 30.021277],
        平顶山: [113.198935, 33.772051],
        阜新市: [121.676518, 42.027983],
        普洱市: [100.98114, 22.788486],
        三亚: [109.518646, 18.258217],
        赣州: [114.94126, 25.837179],
        广元: [105.849993, 32.441808],
        锦州: [121.133631, 41.100869],
        南充: [106.117231, 30.843297],
        衡阳: [112.578397, 26.899517],
        齐齐哈尔: [123.924531, 47.360087],
        兴安盟: [122.044544, 46.088444],
        乌海市: [106.80185, 39.660154],
        楚雄彝族自治州: [101.534082, 25.051226],
        伊春市: [128.84704, 47.733329],
        陇南市: [104.928233, 33.406825],
        荆门: [112.205843, 31.041792],
        辽源市: [125.150107, 42.8943],
        怀化: [110.008116, 27.575595],
        牡丹江: [129.638976, 44.558647],
        黄南藏族自治州: [102.021495, 35.526125],
        湛江: [110.365494, 21.277163],
        天水市: [105.731276, 34.587162],
        黔东南苗族侗族自治州: [107.990602, 26.589858],
        云浮: [112.051045, 22.921154],
        安康: [109.03592, 32.690575],
        日喀则地区: [88.956063, 29.26816],
        海北藏族自治州: [100.907395, 36.960702],
        海西蒙古族藏族自治州: [97.377823, 37.382839],
        吉安: [115.00027, 27.119751],
        黄石: [115.045433, 30.205336],
        宿州: [116.970454, 33.652034],
        茂名: [110.931773, 21.669051],
        阳江: [111.989051, 21.864421],
        信阳: [114.099264, 32.153186],
        三门峡市: [111.206832, 34.55],
        咸宁: [114.328967, 29.847123],
        许昌: [113.858804, 34.041737],
        保山市: [99.168373, 25.117882],
        鹤壁: [114.304044, 35.752656],
        运城市: [111.013379, 35.032587],
        达州: [107.474504, 31.214347],
        常德: [111.704994, 29.037723],
        酒泉市: [99.500427, 39.738615],
        马鞍山: [118.512691, 31.67633],
        南阳市: [112.535009, 32.55],
        邵阳: [111.474133, 27.245167],
        黔南布依族苗族自治州: [107.528663, 26.260586],
        孝感: [113.922962, 30.930712],
        安顺: [105.952622, 26.259904],
        辽阳市: [123.243726, 41.274452],
        黔西南布依族苗族自治州: [104.910858, 25.095974],
        克拉玛依: [84.89587, 45.585765],
        庆阳市: [107.649305, 35.716096],
        呼伦贝尔市: [119.77221, 49.217977],
        六盘水: [104.836786, 26.599086],
        新余: [114.923664, 27.823541],
        七台河市: [131.009618, 45.776512],
        商丘: [115.662798, 34.420378],
        漯河: [114.02323, 33.587703],
        乌兰察布市: [113.140223, 40.999972],
        潜江: [112.905773, 30.407633],
        定西市: [104.631662, 35.587354],
        鸡西市: [130.976161, 45.300906],
        汕尾: [115.381693, 22.791322],
        四平市: [124.356844, 43.172447],
        西双版纳傣族自治州: [100.803836, 22.013792],
        遂宁: [105.599152, 30.539156],
        商洛: [109.94688, 33.876525],
        海南藏族自治州: [100.626831, 36.292132],
        文山壮族苗族自治州: [104.221606, 23.404187],
        六安: [116.529651, 31.741226],
        张家界: [110.484925, 29.122477],
        潮州: [116.62943, 23.662923],
        蚌埠: [117.395835, 32.921498],
        桂林市: [110.296442, 25.00],
        甘南藏族自治州: [102.917605, 34.98901],
        驻马店: [114.029465, 33.017546],
        林芝地区: [94.368109, 29.654792],
        百色市: [106.624969, 23.55],
        鞍山: [123.000974, 41.114122],
        郴州: [113.021311, 25.776711],
        巴中: [106.753912, 31.872851],
        恩施土家族苗族自治州: [109.494763, 30.277908],
        十堰: [110.80454, 32.635042],
        临沧市: [100.10566, 23.914336],
        泸州: [105.449092, 28.877577],
        平凉市: [106.671741, 35.549266],
        宣城: [118.765196, 30.946576],
        绵阳: [104.686164, 31.473364],
        佳木斯市: [130.32696, 46.806581],
        遵义: [106.933658, 27.731749],
        钦州: [108.66089, 21.985392],
        玉树藏族自治州: [97.01308, 33.011061],
        本溪: [123.773468, 41.299847],
        朔州市: [112.438184, 39.33789],
        毕节地区: [105.333323, 27.408562],
        张掖市: [100.456221, 38.932187],
        南平: [118.1843, 26.647662],
        濮阳: [115.035917, 35.767586],
        宜宾: [104.648103, 28.75761],
        铜仁地区: [109.168558, 27.674903],
        松原市: [124.831633, 45.147201],
        漳州: [117.653827, 24.519197],
        梧州市: [111.00, 23.10],
        洛阳: [112.460033, 34.624376],
        龙岩: [117.023668, 25.081257],
        莆田: [119.014232, 25.45996],
        济源: [112.609314, 35.072867],
        哈密地区: [93.522785, 42.824642],
        昭通市: [103.723311, 27.344057],
        大理白族自治州: [100.274223, 25.612206],
        昌吉回族自治州: [87.314822, 44.016923],
        迪庆藏族自治州: [99.70948, 27.825264],
        黑河市: [126.535014, 50.251193],
        吉林市: [126.556073, 43.843512],
        广安: [106.639772, 30.461708],
        黄山: [118.174807, 30.133213],
        德阳: [104.404319, 31.133105],
        河池: [108.091898, 24.698828],
        益阳: [112.361677, 28.559818],
        通化市: [125.946506, 41.733906],
        永州: [111.618703, 26.426612],
        周口: [114.703433, 33.631958],
        梅州: [116.129179, 24.294311],
        锡林郭勒盟: [116.054141, 43.939525],
        固原: [106.24917, 36.021609],
        滁州: [118.323252, 32.308165],
        荆州: [112.24722, 30.340606],
        芜湖: [118.439561, 31.358798],
        襄阳: [112.250093, 32.229169],
        榆林: [109.741195, 38.290886],
        果洛藏族自治州: [100.251341, 34.477207],
        玉林: [110.18743, 22.660656],
        临夏回族自治州: [103.217303, 35.607475],
        鄂州: [114.901557, 30.396522],
        晋中市: [112.759375, 37.692757],
        巴音郭楞蒙古自治州: [86.151584, 41.770226],
        澳门: [113.549403, 22.192961],
        内江: [105.065028, 29.585836],
        揭阳: [116.37922, 23.555773],
        通辽市: [122.251207, 43.658363],
        阜阳: [115.821389, 32.895879],
        中卫: [105.203332, 37.506058],
        铜陵: [117.818795, 30.950899],
        红河哈尼族彝族自治州: [103.38215, 23.369914],
        曲靖: [103.802685, 25.496328],
        香港: [114.171994, 22.281089],
        汉中: [107.030197, 33.07382],
        乐山: [103.77193, 29.558141],
        新乡: [113.933349, 35.308973],
        晋城市: [112.857706, 35.496081],
        巴彦淖尔市: [107.394129, 40.749427],
        武威市: [102.644524, 37.934078],
        岳阳: [113.135679, 29.363262],
        赤峰: [118.895463, 42.264586],
        白山市: [126.431052, 41.94643],
        攀枝花: [101.725262, 26.588109],
        黄冈市: [115.33, 30.459422],
        绥化市: [126.975678, 47.30],
        双鸭山市: [132.165442, 46.652966],
        凉山彝族自治州: [102.273965, 27.887685],
        伊犁哈萨克自治州: [81.330697, 43.922815],
        德宏傣族景颇族自治州: [98.591419, 24.438031],
        安阳市: [114.3996, 36.103649],
        三明市: [117.645742, 26.269683],
        宜春市: [114.422683, 27.820089],
        上饶市: [117.950028, 28.460864],
        自贡市: [104.784891, 29.345379],
        娄底市: [112.001082, 27.703196],
        丽江市: [100.23357, 26.862521],
        防城港市: [108.361138, 21.693439],
        淮北市: [116.804878, 33.96064],
        儋州市: [109.587145, 19.527081],
        怒江州: [98.863189, 25.823736],
        焦作市: [113.248557, 35.221493],
        铁岭市: [123.848797, 42.292573],
        抚顺市: [123.963595, 41.886078],
        巢湖市: [117.88049, 31.608733],
        西双版纳市: [100.803836, 22.013792],
        德宏州: [98.591419, 24.438031],
        恩施市: [109.485727, 30.30089],
        湘西州: [109.745507, 28.317399],
        西昌市: [102.269526, 27.900601],
        阿坝州: [102.231186, 31.905609],
        黔南州: [107.528663, 26.260586],
        黔东南州: [107.990602, 26.589858],
        黔西南州: [104.910858, 25.095974],
        大理州: [100.274223, 25.612206],
        红河州: [103.38215, 23.369914],
        文山州: [104.221606, 23.404187],
        楚雄州: [101.534082, 25.051226],
        迪庆州: [99.70948, 27.825264],
        山南地区: [91.779601, 29.24309],
        那曲地区: [92.0578, 31.482375],
        博尔塔拉蒙古自治州: [82.073064, 44.912168],
        临夏州: [103.217303, 35.607475],
        甘南州: [102.917605, 34.98901],
        格尔木: [94.909745, 36.408588],
        奎屯: [84.90832, 44.432645],
        亳州: [115.7786, 33.8445],
        崇左市: [107.3647, 22.3765],
        定安县: [110.3588, 19.33],
        东方: [108.6518, 19.0953],
        贵港市: [109.5989, 23.1115],
        贺州市: [111.77, 24.4035],
        嘉峪关: [98.2891, 39.7731],
        金昌: [102.1880, 38.5200],
        来宾市: [109.2214, 23.7503],
        乐东黎族自治县: [109.1730, 18.7502],
        陵水黎族自治县: [110.0375, 18.5060],
        眉山: [103.8485, 30.0754],
        琼海: [110.4921, 19.2396],
        台湾: [120.9605, 23.6978],
        天门市: [113.3169, 30.55],
        屯昌县: [110.1034, 19.10],
        万宁市: [110.3816, 18.60],
        文昌市: [113.8259, 25.8228],
        五指山: [109.5169, 18.7751],
        仙桃: [113.4234, 30.3608],
        资阳: [104.6520, 30.1246],
        大兴安岭地区: [124.70, 52.33],
        // 国家地理点

        纽约: [-73.75, 42.65],
        里约热内卢: [-43.15, -22.54],
        莫斯科: [37.37, 55.45],
        渥太华: [-75.43, 45.25],
      },
      worldData: [
        { name: "美国", gold: 46, silver: 29, copper: 29, value: 104 },
        { name: "中国", gold: 38, silver: 27, copper: 23, value: 169 },
        { name: "英国", gold: 29, silver: 17, copper: 19, value: 65 },
        { name: "俄罗斯", gold: 24, silver: 25, copper: 33, value: 82 },
        { name: "韩国", gold: 13, silver: 8, copper: 7, value: 28 },
        { name: "德国", gold: 11, silver: 19, copper: 14, value: 44 },
        { name: "法国", gold: 11, silver: 11, copper: 12, value: 34 },
        { name: "意大利", gold: 8, silver: 9, copper: 11, value: 28 },
        { name: "匈牙利", gold: 8, silver: 4, copper: 5, value: 17 },
        { name: "澳大利亚", gold: 7, silver: 16, copper: 12, value: 35 },
        { name: "日本", gold: 7, silver: 14, copper: 17, value: 38 },
        { name: "哈萨克斯坦", gold: 7, silver: 1, copper: 5, value: 13 },
        { name: "荷兰", gold: 6, silver: 6, copper: 8, value: 20 },
        { name: "乌克兰", gold: 6, silver: 5, copper: 9, value: 20 },
        { name: "古巴", gold: 5, silver: 3, copper: 6, value: 14 },
        { name: "新西兰", gold: 5, silver: 3, copper: 5, value: 13 },
        { name: "伊朗", gold: 4, silver: 5, copper: 3, value: 12 },
        { name: "牙买加", gold: 4, silver: 4, copper: 4, value: 12 },
        { name: "捷克", gold: 4, silver: 3, copper: 3, value: 10 },
        { name: "朝鲜", gold: 4, silver: 0, copper: 2, value: 6 },
        { name: "西班牙", gold: 3, silver: 10, copper: 4, value: 17 },
        { name: "巴西", gold: 3, silver: 5, copper: 9, value: 17 },
        { name: "白俄罗斯", gold: 3, silver: 5, copper: 5, value: 13 },
        { name: "南非", gold: 3, silver: 2, copper: 1, value: 6 },
        { name: "埃塞俄比亚", gold: 3, silver: 1, copper: 3, value: 7 },
        { name: "克罗地亚", gold: 3, silver: 1, copper: 2, value: 6 },
        { name: "罗马尼亚", gold: 2, silver: 5, copper: 2, value: 9 },
        { name: "肯尼亚", gold: 2, silver: 4, copper: 5, value: 11 },
        { name: "丹麦", gold: 2, silver: 4, copper: 3, value: 9 },
        { name: "波兰", gold: 2, silver: 2, copper: 6, value: 10 },
        { name: "阿塞拜疆", gold: 2, silver: 2, copper: 6, value: 10 },
        { name: "土耳其", gold: 2, silver: 2, copper: 1, value: 5 },
        { name: "瑞士", gold: 2, silver: 2, copper: 0, value: 4 },
        { name: "立陶宛", gold: 2, silver: 1, copper: 2, value: 5 },
        { name: "挪威", gold: 2, silver: 1, copper: 1, value: 4 },
        { name: "加拿大", gold: 1, silver: 5, copper: 12, value: 18 },
        { name: "瑞典", gold: 1, silver: 4, copper: 3, value: 8 },
        { name: "哥伦比亚", gold: 1, silver: 3, copper: 4, value: 8 },
        { name: "格鲁吉亚", gold: 1, silver: 3, copper: 3, value: 7 },
        { name: "墨西哥", gold: 1, silver: 3, copper: 3, value: 7 },
        { name: "爱尔兰", gold: 1, silver: 1, copper: 3, value: 5 },
        { name: "塞尔维亚", gold: 1, silver: 1, copper: 2, value: 4 },
        { name: "斯洛文尼亚", gold: 1, silver: 1, copper: 2, value: 4 },
        { name: "阿根廷", gold: 1, silver: 1, copper: 2, value: 4 },
        { name: "突尼斯", gold: 1, silver: 1, copper: 1, value: 3 },
        { name: "多米尼加", gold: 1, silver: 1, copper: 0, value: 2 },
        { name: "乌兹别克斯坦", gold: 1, silver: 0, copper: 3, value: 4 },
        { name: "特立尼达和多巴哥", gold: 1, silver: 0, copper: 3, value: 4 },
        { name: "拉脱维亚", gold: 1, silver: 0, copper: 1, value: 2 },
        { name: "格林纳达", gold: 1, silver: 0, copper: 0, value: 1 },
        { name: "巴哈马", gold: 1, silver: 0, copper: 0, value: 1 },
        { name: "乌干达", gold: 1, silver: 0, copper: 0, value: 1 },
        { name: "委内瑞拉", gold: 1, silver: 0, copper: 0, value: 1 },
        { name: "阿尔及利亚", gold: 1, silver: 0, copper: 0, value: 1 },
        { name: "印度", gold: 0, silver: 2, copper: 4, value: 6 },
        { name: "蒙古", gold: 0, silver: 2, copper: 3, value: 5 },
        { name: "泰国", gold: 0, silver: 2, copper: 1, value: 3 },
        { name: "埃及", gold: 0, silver: 2, copper: 0, value: 2 },
        { name: "斯洛伐克", gold: 0, silver: 1, copper: 3, value: 4 },
        { name: "比利时", gold: 0, silver: 1, copper: 2, value: 3 },
        { name: "芬兰", gold: 0, silver: 1, copper: 2, value: 3 },
        { name: "亚美尼亚", gold: 0, silver: 1, copper: 2, value: 3 },
        { name: "马来西亚", gold: 0, silver: 1, copper: 1, value: 2 },
        { name: "中华台北", gold: 0, silver: 1, copper: 1, value: 2 },
        { name: "爱沙尼亚", gold: 0, silver: 1, copper: 1, value: 2 },
        { name: "保加利亚", gold: 0, silver: 1, copper: 1, value: 2 },
        { name: "印度尼西亚", gold: 0, silver: 1, copper: 1, value: 2 },
        { name: "波多黎各", gold: 0, silver: 1, copper: 1, value: 2 },
        { name: "黑山", gold: 0, silver: 1, copper: 0, value: 1 },
        { name: "博茨瓦纳", gold: 0, silver: 1, copper: 0, value: 1 },
        { name: "塞浦路斯", gold: 0, silver: 1, copper: 0, value: 1 },
        { name: "葡萄牙", gold: 0, silver: 1, copper: 0, value: 1 },
        { name: "加蓬", gold: 0, silver: 1, copper: 0, value: 1 },
        { name: "危地马拉", gold: 0, silver: 1, copper: 0, value: 1 },
        { name: "卡塔尔", gold: 0, silver: 0, copper: 2, value: 2 },
        { name: "新加坡", gold: 0, silver: 0, copper: 2, value: 2 },
        { name: "希腊", gold: 0, silver: 0, copper: 2, value: 2 },
        { name: "摩尔多瓦", gold: 0, silver: 0, copper: 2, value: 2 },
        { name: "巴林", gold: 0, silver: 0, copper: 1, value: 1 },
        { name: "塔吉克斯坦", gold: 0, silver: 0, copper: 1, value: 1 },
        { name: "中国香港", gold: 0, silver: 0, copper: 1, value: 1 },
        { name: "摩洛哥", gold: 0, silver: 0, copper: 1, value: 1 },
        { name: "沙特阿拉伯", gold: 0, silver: 0, copper: 1, value: 1 },
        { name: "科威特", gold: 0, silver: 0, copper: 1, value: 1 },
        { name: "阿富汗", gold: 0, silver: 0, copper: 1, value: 1 },
      ],
      tableData: [
        ["测试", "测试", "测试", "测试", "测试", "测试"],
        ["测试", "测试", "测试", "测试", "测试", "测试"],
        ["测试", "测试", "测试", "测试", "测试", "测试"],
        ["测试", "测试", "测试", "测试", "测试", "测试"],
        ["测试", "测试", "测试", "测试", "测试", "测试"],
        ["测试", "测试", "测试", "测试", "测试", "测试"],
        ["测试", "测试", "测试", "测试", "测试", "测试"],
      ],
    };
  },
  mounted() {
    this.chinaConfigure();
    // let _this = this;
    window.clickTr = function() {
      alert('跳转详情页面')
    }

    window.onOver = function(index) {
      document.getElementById("tr"+ index).style.border = '2px solid rgb(0, 250, 246)';
    }

    window.onOut = function(index) {
      document.getElementById("tr"+ index).style.border = '';
    }

  },
  methods: {
    // 判断一个城市是否在这个省内
    cityIsInclude(provinceEngName, cityName, cityNameEng) {
      let cities = mapCityName[`cityName_${provinceEngName}`];
      for (let city in cities) {
        if (
          (!cityNameEng && city.indexOf(cityName) !== -1) ||
          (cityNameEng &&
            city.indexOf(cityName) !== -1 &&
            cities[city] === cityNameEng)
        ) {
          return true;
        }
      }
      return false;
    },

    // 将data在坐标点上展示，同时在省市情况下，过滤掉范围外的点
    convertData(data, provinceEngName, cityNameEng) {
      var res = [];
      for (var i = 0; i < data.length; i++) {
        if (provinceEngName) {
          let ret = this.cityIsInclude(
            provinceEngName,
            data[i].name,
            cityNameEng
          );
          if (ret) {
            var geoCoord = this.geoCoordMap[data[i].name];
            if (geoCoord) {
              res.push({
                name: data[i].name,
                value: geoCoord.concat(data[i].value),
              });
            }
          }
        } else {
          let geoCoord = this.geoCoordMap[data[i].name];
          if (geoCoord) {
            res.push({
              name: data[i].name,
              value: geoCoord.concat(data[i].value),
            });
          }
        }
      }
      return res;
    },

    // 设置地图的option配置项   place = "china", center = undefined
    setMapOption(place = "world", center = undefined) {
      var data = this.tableData;
      var flag = this.placeType == "world" ? 1 : this.placeType == "country" ? 2 : 3;
      this.option = {
        backgroundColor: "rgb(0,0,0)", // 地图背景颜色
        tooltip: {
          // 鼠标移到图里面的浮动提示框
          trigger: "item",
          // confine: true,
          show: true,
          enterable: true,
          // position: ['50%', '50%'],
          renderMode:"html",
          appendToBody:true,
          backgroundColor: "transparent",
          //省市的弹窗可以自定义自由更改或者填充数据
          formatter: function (params) {
            //省级弹窗
            var htmlText = `
            <div style="z-index:666;width:220px;height:150px;background:url( ${require("../assets/tipframe.svg")}) no-repeat center center;background-size: 100% 100%;margin:0px;">
              <div style="height:17px"></div>
              <div style="margin-left:10px;padding-top:1px;width:200px;height:127px;background: rgba(57,60,66);opacity: 0.8;">
                <p style="color:aqua;padding-left:23px;padding-top:23px;font-size: 18px;font-weight: 700;">
                ${params.name}
                </p>
                <p style="font-size: 14px;font-weight: normal;padding-left:23px;margin:0;">数量 :</p>
                <p style="padding-left:23px;padding-bottom:10px;margin:0;">数量 :</p>
              </div>

            </div>
            `;
            //表格数据
            var content = '<table style="width:570px;border-collapse: collapse;"><tbody id="tb" style="width:570px;height:250px;">';
            for (var i = 0; i < data.length; i++) {
              if (i == 0) {
                content +=
                '<tr style="text-indent:5px;background-color:rgb(96,99,104);color: white;font-size: 16px;font-color:white;">';
              } else if (i % 2 != 0) {
                content +=
                `<tr id="${"tr" + i}" style="text-indent:5px;background-color:rgb(50,60,66);text-overflow:ellipsis;white-space: nowrap;overflow: hidden;cursor:pointer;" onclick="clickTr()" onmouseover="onOver(${i})" onmouseout="onOut(${i})">`;
              } else if (i % 2 == 0) {
                content +=
                `<tr id="${"tr" + i}" style="text-indent:5px;background-color:rgb(66,70,76);text-overflow:ellipsis;white-space: nowrap;overflow: hidden;cursor:pointer;" onclick="clickTr()" onmouseover="onOver(${i})" onmouseout="onOut(${i})">`;
              }

              for (var j = 0; j < data[i].length; j++) {
                content += '<td style="width:580px;">' + data[i][j] + "</td>";
              }
              content += "</tr >";
            }
            content += "</tbody></table>";
            //市级弹窗
            var htmlText1 = `
            <div style="z-index:666;width:602px;height:300px;border: 3px solid rgb(0, 250, 246)">
              <div style="margin-left:1px;width:600px;height:298px;background: rgba(57,60,66);opacity: 0.9;margin-top:0;">
                <p style="color:aqua;padding-left:15px;padding-top:10px;font-size: 18px;font-weight: 500;margin:0">
                ${params.name}
                </p>
                <div style="margin-left:13px;margin-top:10px;width:600px;height:100%">
                  ${content}
                </div>
              </div>

            </div>
            `;

            if (flag == 1) {
              return;
            } else if (flag == 2) {
              return htmlText;
            } else {
              return htmlText1;
            }
          },
        },
        geo: {
          roam: false, // 拖放与否
          map: place,
          zoom:1.2,
          // show: true,
          center: center,
          aspectScale: 0.80, // 地图长宽比
          nameMap: mapCountryName,

          label: {
            emphasis: {
              show: true,
              color: "#ffffff",
              fontSize: 16,
            },
            normal: {
                show: flag == 1 ? false : true,
                color: "#ffffff",
                fontSize: 16,
            },
          },
          itemStyle: {
            normal: {
              areaColor: "rgb(32, 40, 56, 0.5)",
              borderWidth: 1.5,//设置外层边框
              borderColor:'#00ffff',

            },
            emphasis: {
              // 图块悬浮颜色
              show: true,
              areaColor: "rgb(0, 199, 199)",

            },
          },
        },
        //***********************************************  series settings ***************************************************/
        series: [
          {
            geoIndex: 0, // 将数据和第0个geo配置关联在一起
            type: "map",
            map: place,
            data:
              this.placeType === "world"
                ? this.worldData
                : this.placeType === "country"
                ? this.provinceData
                : this.convertData(this.data), // 在series中引入自定义的数据
            nameMap: mapCountryName,
            tooltip: {
              // 鼠标移到图里面的浮动提示框
              trigger: "item",
              triggerOn: "mousemove",
              showContent: true,
              show: true,
            },
            itemStyle: {
              normal: {
                areaColor: "rgb(65, 75, 97)",
                borderColor: "rgb(0, 250, 246)",
                // shadowColor: "transparent",
                borderWidth: 1,

              },
              emphasis: {
                // 图块悬浮颜色
                show: true,
                areaColor: "rgb(0, 199, 199)",

              },
            },
          },

          // 国内闪烁点(省会)以及静态点(城市)
          {
            name: "test-data",
            type: "scatter",
            coordinateSystem: "geo", // 坐标系选择
            data:
              (this.placeType === "world" || this.placeType === "country") ? [] : this.convertData(this.data), // 过滤点选择，指定数据
            symbol: 'image://' + require('../assets/diamond.png'),
            encode: {
              value: 2,
            },
            // large: true, //大数据优化卡顿
            // largeThreshold: 2000  //优化阈值
            symbolSize: 26,
            itemStyle: {
              normal: {
                color: "#00CF8B",
              },
            },
          },
          {
            name: "inside-china",
            type: "effectScatter",
            coordinateSystem: "geo",
            symbol: 'image://' + require('../assets/diamond.png'),
            data:
              this.placeType === "world"
                ? []
                : this.placeType === "province" ? [] : this.convertData(
                    this.provinceCenter
                  ),
            encode: {
              value: 2,
            },
            symbolSize: 6,
            showEffectOn: "render", // 何时显示特效
            effectType: "ripple", // 特效类型，暂时只有涟漪类型
            rippleEffect: {
              //涟漪特效设置
              period: 6,
              scale: 8,
              brushType: "stroke",
              // color: '#FF7744',
              number: 3,
            },
            hoverAnimation: true,
            itemStyle: {
              normal: {
                // color: "#FF8C00",
                color: '#FF7744',
                // shadowBlur: 10,
                // shadowColor: '#333'
              },
            },
            zlevel: 1, 
          },
          // 国家闪烁点
          {
            name: "country-data",
            type: "effectScatter",
            coordinateSystem: "geo",
            symbol: 'image://' + require('../assets/diamond.png'),
            data:
              this.placeType === "world"
                ? this.convertData(this.countryData)
                : [],
            encode: {
              value: 2,
            },
            symbolSize: 8,
            showEffectOn: "render", // 何时显示特效
            effectType: "ripple", // 特效类型，暂时只有涟漪类型
            rippleEffect: {
              // color: // 波纹涟漪颜色
              number: 5,
              period: 6,
              scale: 8,
              brushType: "stroke",
            },
            hoverAnimation: true,
            itemStyle: {
              normal: {
                color: "#FF1493",
                shadowBlur: 10,
                // shadowColor: '#333'
              },
            },
            zlevel: 1,
          },
        ],
      };
    },

    // 鼠标拖动事件（使拖动不触发返回事件）
    mousedown(e) {
      this.mouse_position.beginX = e.clientX;
      this.mouse_position.beginY = e.clientY;
    },
    mouseup(e) {
      this.mouse_position.endX = e.clientX;
      this.mouse_position.endY = e.clientY;
    },

    // 拖动，允许存在4px误差
    isdrag(x1, y1, x2, y2) {
      if (Math.sqrt((x1 - x2) * (x1 - x2) + (y1 - y2) * (y1 - y2)) <= 4) {
        return false;
      }
      return true;
    },

    // 点击返回上一级
    clickBack() {
      if (
        !this.isdrag(
          this.mouse_position.beginX,
          this.mouse_position.beginY,
          this.mouse_position.endX,
          this.mouse_position.endY
        )
      ) {
        // 从市返回省
        if (this.placeType == "city" && this.province.name) {
          this.placeType = "province";
          this.city.code = "";
          this.city.name = "";
          this.setMapOption(this.province.name);
          this.option.series[0].data = this.convertData(
            this.data,
            provinceNameTrans(this.province.name)
          );
          this.option.series[1].data = this.convertData(
            this.data
              .sort(function (a, b) {
                return b.value - a.value;
              })
              .slice(0, 5),
            provinceNameTrans(this.province.name)
          );
          this.echart.setOption(this.option);
        } else if (this.placeType == "province") {
          // 从省返回国家
          this.placeType = "country";
          this.province.code = "";
          this.province.name = "";
          this.city.code = "";
          this.city.name = "";
          this.setMapOption("china");
          this.echart.setOption(this.option);
        } else if (this.placeType == "country") {
          //从国家返回世界地图
          this.placeType = "world";
          this.setMapOption();
          this.echart.setOption(this.option);
        }

      }
    },

    // 渲染echart地图
    chinaConfigure() {
      this.echart = echarts.init(this.$refs.myEchart); // 这里是为了获得容器所在位置
      window.onresize = this.echart.resize;
      // echart配置项
      this.setMapOption();
      this.echart.setOption(this.option);

      // 点击事件
      this.echart.on("click", (params) => {
        event.stopPropagation(); // 阻止冒泡

        if (params.name === "China" || params.name === "中国") {
          this.placeType = "country";
          this.setMapOption("china");
          this.echart.setOption(this.option);
          return;
        }

        // 对点击的省的处理
        let province = mapProvinceName.find(
          (item) => item.chineseName === params.name
        );
        // 点击省进入省级地图
        if (this.placeType === "country" && province) {
          this.setProvinceMap(province.chineseName, province.code);
        } else if (
          this.placeType === "province" &&
          !mapCityName[
            `cityName_${provinceNameTrans(this.province.name)}`
          ]
        ) {
          // 
        }
      });
    },

    // 设置省份地图
    setProvinceMap(name, code) {
      axios
        .get(`mapData/mapProvince/${code}.json`)
        .then((res) => {
          this.placeType = "province";
          this.province.name = name;
          this.province.code = code;
          this.setMapOption(name, res.data.cp);
          this.option.series[0].data = this.convertData(
            this.data,
            provinceNameTrans(name)
          );
          this.option.series[1].data = this.convertData(
            //进入省级地图渲染省会闪烁点
            this.data,
            provinceNameTrans(name)
          );
          echarts.registerMap(name, res.data);
          this.echart.setOption(this.option);
        })
        .catch((err) => {
          if (err.code) alert("Error");
        });
    },
  },


  beforeDestroy() {
    if (!this.echart) {
      return;
    }
    this.echart.dispose();
    this.echart = null;
  },
};
</script>

<style scoped>
.action {
  width: 200px;
  height: 100px;
}
.echart-map {
  width: 100%;
  height: 90vh;
}

.custom-tooltip-box >>> {
  padding: 0 !important;
  border: none !important;
  background-color: transparent !important;
}

</style>
